---
title: AreaVolumeSettings
classe: Autodesk.Revit.DB.AreaVolumeSettings
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.Element
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# AreaVolumeSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean ComputeVolumes { get; set; }` | `areaVolumeSettings.ComputeVolumes` | Boolean |
| `AreaVolumeSettings GetAreaVolumeSettings(Document)` | `AreaVolumeSettings.GetAreaVolumeSettings(aDoc)` | AreaVolumeSettings |
| `SpatialElementBoundaryLocation GetSpatialElementBoundaryLocation(SpatialElementType)` | `areaVolumeSettings.GetSpatialElementBoundaryLocation(spType)` | SpatialElementBoundaryLocation |
| `Void SetSpatialElementBoundaryLocation(SpatialElementBoundaryLocation, SpatialElementType)` | `areaVolumeSettings.SetSpatialElementBoundaryLocation(spatialElementBoundaryLocation, spType)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```